In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv("Bengaluru_House_Data.csv")

In [3]:
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
data.shape

(13320, 9)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

checking info and then count the values

In [8]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
********************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: availability, Length: 81, dtype: int64
********************
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64
********************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64
********************
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: society, Length: 2688, dtype: int64
********************
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: total_sqft, Length: 2117, dtype: int64
********************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: bath, dtype: int64
********************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
********************
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: price, Length: 1994, dtype: int64
********************

In [9]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [10]:
data.drop(columns=['area_type','availability','society','balcony'],inplace=True)

In [11]:
data.shape

(13320, 5)

successfully droped the valus which are of no use

In [12]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [14]:
data['location'].value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64

filling up the missing values

In [16]:
data['location'] = data['location'].fillna('Sarjapur Road')

becaiuse there was only one missing value inside the lcoaiton column

In [19]:
data['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64

size had 16 missing vlaues as  seen above

In [20]:
data['size'] = data['size'].fillna('2 BHK')

In [21]:
data['bath'] = data['bath'].fillna(data['bath'].median())

because vath was categorical data so just added median values in nan

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

fixing bhk and bedroom

In [23]:
data['bhk']= data['size'].str.split().str.get(0).astype(int)

# ***************or use lamba fucntions
'''
data['bhk'] = data['size'].apply(lambda x: int(x.split(' ')[0]))

this also can get me the first required bvlaues from column size
'''

In [24]:
# checking flat bigger than 40 so basiiscaly outliers

In [56]:
data[data.bhk>=20]
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.564544      2.559537    111.382401      2.650838      630.397936
std     1261.271296      1.077938    152.077329      0.976678      416.223798
min      300.000000      1.000000      8.440000      1.000000       26.782981
25%     1116.000000      2.000000     49.000000      2.000000      421.052632
50%     1300.000000      2.000000     70.000000      3.000000      529.411765
75%     1700.000000      3.000000    115.000000      3.000000      691.666667
max    52272.000000     16.000000   3600.000000     16.000000    17647.058824

In [57]:
# getting the ranges fixed 
data['total_sqft'].unique()

array([1056. , 2600. , 1440. , ..., 2758. , 1258.5, 4689. ])

In [58]:
# here we see meter so we need to fix that'
# so to make this  creating functon
def convert_sqft_to_num(x):
    tokens = x.split('-')
    if len(tokens)==2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [59]:
convert_sqft_to_num('2100 - 2850')

2475.0

In [60]:
convert_sqft_to_num('34.46Sq. Meter')
# didnt return anything

In [61]:
data['total_sqft']=data['total_sqft'].apply(convert_sqft_to_num)

AttributeError: 'float' object has no attribute 'split'

In [62]:
data.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,369.981061
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,461.538462
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,430.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,624.589086
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,425.000000

getting price per sq_ft

In [63]:
data['price_per_sqft'] = data['price']*10000/data['total_sqft']

In [64]:
data['price_per_sqft']

0         369.981061
1         461.538462
2         430.555556
3         624.589086
4         425.000000
            ...
13315     668.983493
13316    1111.111111
13317     525.854514
13318    1040.733632
13319     309.090909
Name: price_per_sqft, Length: 12530, dtype: float64

In [65]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.564544      2.559537    111.382401      2.650838      630.397936
std     1261.271296      1.077938    152.077329      0.976678      416.223798
min      300.000000      1.000000      8.440000      1.000000       26.782981
25%     1116.000000      2.000000     49.000000      2.000000      421.052632
50%     1300.000000      2.000000     70.000000      3.000000      529.411765
75%     1700.000000      3.000000    115.000000      3.000000      691.666667
max    52272.000000     16.000000   3600.000000     16.000000    17647.058824

# lots of location 
# this is high dimentionality problewm 
# now use dimnetiuonality reduction

In [66]:
data['location'].value_counts()

other                   2555
Whitefield               538
Sarjapur  Road           395
Electronic City          295
Kanakpura Road           269
                        ...
5th Block Hbr Layout       7
Vishveshwarya Layout       7
Vishwapriya Layout         7
Thyagaraja Nagar           7
Marsur                     5
Name: location, Length: 242, dtype: int64

In [67]:
data['location'] = data['location'].apply(lambda x: x.strip())
location_count = data['location'].value_counts()

In [68]:
location_count

other                   2555
Whitefield               538
Sarjapur  Road           395
Electronic City          295
Kanakpura Road           269
                        ...
5th Block Hbr Layout       7
Vishveshwarya Layout       7
Vishwapriya Layout         7
Thyagaraja Nagar           7
Marsur                     5
Name: location, Length: 242, dtype: int64

In [69]:
locations_count_lessthan10 = location_count[location_count<=10]
locations_count_lessthan10

Tindlu                  10
1st Block Jayanagar     10
Shivaji Nagar           10
ISRO Layout             10
Laggere                 10
Bommenahalli            10
Giri Nagar              10
Nagasandra               9
2nd Stage Nagarbhavi     9
HAL 2nd Stage            9
Shampura                 9
Mahalakshmi Layout       9
Kodigehalli              8
Banjara Layout           8
5th Block Hbr Layout     7
Vishveshwarya Layout     7
Vishwapriya Layout       7
Thyagaraja Nagar         7
Marsur                   5
Name: location, dtype: int64

In [70]:
data['location'] = data['location'].apply(lambda x: 'other' if x in locations_count_lessthan10 else x)

In [71]:
data['location'].value_counts()

other                        2719
Whitefield                    538
Sarjapur  Road                395
Electronic City               295
Kanakpura Road                269
                             ...
Banashankari Stage VI          11
2nd Phase Judicial Layout      11
Vasanthapura                   11
LB Shastri Nagar               11
Nehru Nagar                    11
Name: location, Length: 223, dtype: int64

# outliers detection and handling

In [72]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.564544      2.559537    111.382401      2.650838      630.397936
std     1261.271296      1.077938    152.077329      0.976678      416.223798
min      300.000000      1.000000      8.440000      1.000000       26.782981
25%     1116.000000      2.000000     49.000000      2.000000      421.052632
50%     1300.000000      2.000000     70.000000      3.000000      529.411765
75%     1700.000000      3.000000    115.000000      3.000000      691.666667
max    52272.000000     16.000000   3600.000000     16.000000    17647.058824

In [73]:
# probelm is total_sqft whre its only 1 sqft 

(data['total_sqft']/data['bhk']).describe()

count    12530.000000
mean       597.801113
std        387.603963
min        300.000000
25%        492.000000
50%        562.500000
75%        630.333333
max      26136.000000
dtype: float64

In [74]:
data = data[((data['total_sqft']/data['bhk']) >= 300)]
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.564544      2.559537    111.382401      2.650838      630.397936
std     1261.271296      1.077938    152.077329      0.976678      416.223798
min      300.000000      1.000000      8.440000      1.000000       26.782981
25%     1116.000000      2.000000     49.000000      2.000000      421.052632
50%     1300.000000      2.000000     70.000000      3.000000      529.411765
75%     1700.000000      3.000000    115.000000      3.000000      691.666667
max    52272.000000     16.000000   3600.000000     16.000000    17647.058824

In [75]:
data.shape

(12530, 7)

In [76]:
data.price_per_sqft.describe()

count    12530.000000
mean       630.397936
std        416.223798
min         26.782981
25%        421.052632
50%        529.411765
75%        691.666667
max      17647.058824
Name: price_per_sqft, dtype: float64

In [80]:
def remove_pps_outliers(df):
    df_out= pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        
        st= np.std(subdf.price_per_sqft)
        
        reduced_df=subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft <= (m+st))]
        df_out = pd.concat([df_out, reduced_df], ignore_index=True)
    return df_out

data = remove_pps_outliers(data)
data.describe()

         total_sqft         bath        price          bhk  price_per_sqft
count   4531.000000  4531.000000  4531.000000  4531.000000     4531.000000
mean    1457.140580     2.409402    81.343348     2.521518      533.123943
std      846.631184     0.909547    67.630062     0.860804      163.047267
min      360.000000     1.000000    10.000000     1.000000      250.000000
25%     1100.000000     2.000000    50.000000     2.000000      445.244249
50%     1261.000000     2.000000    65.500000     2.000000      510.610080
75%     1595.000000     3.000000    89.000000     3.000000      585.744172
max    30400.000000    16.000000  1824.000000    16.000000     2064.516129